<?xml version="1.0"?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="mobilenet_v3_Small" type="Parameter" version="opset1">
			<data shape="1,224,224,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="mobilenet_v3_Small">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_4468_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_4468" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="MobileNetV3Small_1/rescaling_1/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/rescaling_1/mul:0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_4469_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_4469" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="MobileNetV3Small_1/rescaling_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/rescaling_1/add:0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0/input_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="8" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0/input_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="9" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0/input_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="6" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="10" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0/input_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0/output_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="12" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0/output_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="13" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0/output_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="6" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="14" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0/output_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="15" name="MobileNetV3Small_1/rescaling_1/add/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_146" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="MobileNetV3Small_1/conv_bn_1/batchnorm/mul_1__6" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/conv_bn_1/batchnorm/mul_1__6:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_207826" type="Const" version="opset1">
			<data element_type="i8" shape="16, 3, 3, 3" offset="40" size="432" />
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_207827" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_207828_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 1" offset="472" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_207828" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv__316/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv__316/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_160_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="504" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_160" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv__316" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Conv__316:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="MobileNetV3Small_1/activation_1/mul" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobileNetV3Small_1/activation_1/mul:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="MobileNetV3Small_1/activation_1/mul/fq_output_0/input_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="536" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="MobileNetV3Small_1/activation_1/mul/fq_output_0/input_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="MobileNetV3Small_1/activation_1/mul/fq_output_0/input_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="568" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="MobileNetV3Small_1/activation_1/mul/fq_output_0/input_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="MobileNetV3Small_1/activation_1/mul/fq_output_0/output_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="536" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="MobileNetV3Small_1/activation_1/mul/fq_output_0/output_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="MobileNetV3Small_1/activation_1/mul/fq_output_0/output_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="568" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="MobileNetV3Small_1/activation_1/mul/fq_output_0/output_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="MobileNetV3Small_1/activation_1/mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_207830" type="Const" version="opset1">
			<data element_type="i8" shape="16, 1, 1, 3, 3" offset="600" size="144" />
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Convert_207831" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_207832_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 1, 1" offset="744" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_207832" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MobileNetV3Small_1/expanded_conv_depthwise_bn_1/batchnorm/mul_1/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="MobileNetV3Small_1/expanded_conv_depthwise_bn_1/batchnorm/mul_1" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/expanded_conv_depthwise_1/depthwise:0,MobileNetV3Small_1/expanded_conv_depthwise_bn_1/batchnorm/mul_1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="const_fold_opt__887_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="776" size="32" />
			<output>
				<port id="0" precision="FP16" names="const_fold_opt__887">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="const_fold_opt__887" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="MobileNetV3Small_1/expanded_conv_depthwise_bn_1/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/expanded_conv_depthwise_bn_1/batchnorm/add_1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="MobileNetV3Small_1/re_lu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobileNetV3Small_1/re_lu_1/Relu:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0/input_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="48" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0/input_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="49" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0/input_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="810" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="50" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0/input_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="51" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0/output_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="52" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0/output_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="53" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0/output_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="810" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="54" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0/output_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="55" name="MobileNetV3Small_1/re_lu_1/Relu/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Range_231" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="812" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0/input_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="59" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0/input_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="60" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0/input_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="828" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="61" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0/input_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="62" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0/output_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="63" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0/output_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="64" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0/output_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="828" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="65" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0/output_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="66" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_avg_pool_1/Mean/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="new_shape__804" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="830" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="new_shape__804">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_conv_1/convolution__20" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/expanded_conv_squeeze_excite_conv_1/convolution__20:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_207834" type="Const" version="opset1">
			<data element_type="i8" shape="8, 16, 1, 1" offset="862" size="128" />
			<output>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Convert_207835" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_207836_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 1, 1, 1" offset="990" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_207836" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv__330/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv__330/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_250_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="1006" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_250" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv__330" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Conv__330:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0/input_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="80" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0/input_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="81" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0/input_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="1022" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="82" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0/input_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="83" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0/output_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="84" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0/output_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="85" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0/output_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="1022" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="86" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0/output_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="87" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_relu_1/Relu/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="new_shape__799" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1024" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="new_shape__799">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_conv_1_2/convolution__24" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/expanded_conv_squeeze_excite_conv_1_2/convolution__24:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_207838" type="Const" version="opset1">
			<data element_type="i8" shape="16, 8, 1, 1" offset="1056" size="128" />
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Convert_207839" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_207840_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 1" offset="1184" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_207840" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv__332/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv__332/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_268_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="1216" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_268" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv__332" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Conv__332:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="MobileNetV3Small_1/re_lu_1_2/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="MobileNetV3Small_1/re_lu_1_2/Relu6:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_4470_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="1248" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_4470" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="MobileNetV3Small_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/Mul:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="MobileNetV3Small_1/Mul/fq_output_0/input_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="104" name="MobileNetV3Small_1/Mul/fq_output_0/input_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="105" name="MobileNetV3Small_1/Mul/fq_output_0/input_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="1250" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="106" name="MobileNetV3Small_1/Mul/fq_output_0/input_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="107" name="MobileNetV3Small_1/Mul/fq_output_0/output_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="108" name="MobileNetV3Small_1/Mul/fq_output_0/output_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="109" name="MobileNetV3Small_1/Mul/fq_output_0/output_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="1250" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="110" name="MobileNetV3Small_1/Mul/fq_output_0/output_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="111" name="MobileNetV3Small_1/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul/fq_output_0/input_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="114" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul/fq_output_0/input_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul/fq_output_0/input_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="810" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="116" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul/fq_output_0/input_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="117" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul/fq_output_0/output_low_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="808" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="118" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul/fq_output_0/output_low" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="119" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul/fq_output_0/output_high_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="810" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="120" name="MobileNetV3Small_1/expanded_conv_squeeze_excite_mul_1/Mul/fq_output_0/output_high" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
